#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_container_registry.api_registry will be created
  + resource "digitalocean_container_registry" "api_registry" {
      + endpoint               = (known after apply)
      + id                     = (known after apply)
      + name                   = "foreign-language-reader-api"
      + server_url             = (known after apply)
      + subscription_tier_slug = "starter"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
